{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"waveform": {"name": "waveform:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5000"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "129"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/zeros_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/ones_like", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/floordiv_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat_1/values_1/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/range_1/start", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/range_1/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape_2/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape_3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/strided_slice", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape/shape_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame_step", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame_length", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/packed", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat_2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/hann_window/sub_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/rfft/fft_length", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/reduce_std/reduce_variance/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/reduce_std/reduce_variance/Mean_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/add_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/reshape_1_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/reshape_1_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/reshape_1_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/reshape_1_1/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/reshape_1_1/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/reshape_1_1/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/conv2d_4_1/convolution/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/batch_normalization_4_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/conv2d_5_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/batch_normalization_5_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/conv2d_6_1/convolution/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/batch_normalization_6_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/conv2d_7_1/convolution/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/batch_normalization_7_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/global_average_pooling2d_1_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/species_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/species_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "waveform", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "5000"}]}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Shape", "op": "Shape", "input": ["waveform"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/split", "op": "SplitV", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Shape", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/packed", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/split/split_dim"], "attr": {"num_split": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tlen": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/split:1", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape/shape_1"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/floordiv_3", "op": "FloorDiv", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/floordiv_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/sub_2", "op": "Sub", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame_length"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/mul", "op": "Mul", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/floordiv_3", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat_1/values_1", "op": "Pack", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/floordiv_3", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat_1/values_1/1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/floordiv", "op": "FloorDiv", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/sub_2", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame_step"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat/values_1_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/mul"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/split", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat_1/values_1", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/split:2", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat_1/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/add", "op": "AddV2", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/add/x", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/floordiv"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat/values_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/mul", "ConstantFolding/StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Const", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/add"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/split", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat/values_1", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/split:2", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/range_1", "op": "Range", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/range_1/start", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Maximum", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/range_1/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape_2/shape", "op": "Pack", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Maximum", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape_2/shape/1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/packed_1", "op": "Pack", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Maximum", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame_length"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/StridedSlice", "op": "StridedSlice", "input": ["waveform", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/zeros_like", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/ones_like"], "attr": {"Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/range_1", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape_2/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat_2", "op": "ConcatV2", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/split", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/packed_1", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/split:2", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat_2/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/StridedSlice", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape_2", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape_3"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape_1", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/add_1", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/strided_slice"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape_4", "op": "Reshape", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/GatherV2", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/mul", "op": "Mul", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape_4", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/hann_window/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/rfft", "op": "RFFT", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/mul", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/rfft/fft_length"], "attr": {"Tcomplex": {"type": "DT_COMPLEX64"}, "Treal": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Abs", "op": "ComplexAbs", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/rfft"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Abs"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Shape", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/axes", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/GatherV2_1/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Shape", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/free", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/GatherV2_1", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/GatherV2", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/GatherV2", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Const_2", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Prod", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Abs", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Reshape", "unknown"], "device": "/device:CPU:0", "attr": {"grad_b": {"b": false}, "grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/MatMul", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/concat_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Log", "op": "Log", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Log", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/reduce_std/reduce_variance/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Log", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/reduce_std/reduce_variance/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Log", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/reduce_std/reduce_variance/sub", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Log", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/reduce_std/reduce_variance/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/reduce_std/reduce_variance/Mean_1", "op": "Mean", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/reduce_std/reduce_variance/sub", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/reduce_std/reduce_variance/Mean_1/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/reduce_std/Sqrt", "op": "Sqrt", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/reduce_std/reduce_variance/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/reduce_std/Sqrt", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/add_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/truediv", "op": "RealDiv", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/sub", "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/reshape_1_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/truediv"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/buzzguard_1/reshape_1_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/buzzguard_1/reshape_1_1/Shape", "StatefulPartitionedCall/buzzguard_1/reshape_1_1/strided_slice/stack", "StatefulPartitionedCall/buzzguard_1/reshape_1_1/strided_slice/stack_1", "StatefulPartitionedCall/buzzguard_1/reshape_1_1/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/reshape_1_1/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/buzzguard_1/reshape_1_1/strided_slice", "StatefulPartitionedCall/buzzguard_1/reshape_1_1/Reshape/shape/1", "StatefulPartitionedCall/buzzguard_1/reshape_1_1/Reshape/shape/2", "StatefulPartitionedCall/buzzguard_1/reshape_1_1/Reshape/shape/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/reshape_1_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/truediv", "StatefulPartitionedCall/buzzguard_1/reshape_1_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/batch_normalization_4_1/batchnorm/add_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/buzzguard_1/reshape_1_1/Reshape", "StatefulPartitionedCall/buzzguard_1/conv2d_4_1/convolution/merged_input", "StatefulPartitionedCall/buzzguard_1/batch_normalization_4_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/max_pooling2d_4_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/buzzguard_1/batch_normalization_4_1/batchnorm/add_1"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/re_lu_4_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/buzzguard_1/max_pooling2d_4_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/batch_normalization_5_1/batchnorm/add_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/buzzguard_1/re_lu_4_1/Relu", "StatefulPartitionedCall/buzzguard_1/conv2d_5_1/convolution/merged_input", "StatefulPartitionedCall/buzzguard_1/batch_normalization_5_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/max_pooling2d_5_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/buzzguard_1/batch_normalization_5_1/batchnorm/add_1"], "attr": {"padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/buzzguard_1/re_lu_5_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/buzzguard_1/max_pooling2d_5_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/batch_normalization_6_1/batchnorm/add_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/buzzguard_1/re_lu_5_1/Relu", "StatefulPartitionedCall/buzzguard_1/conv2d_6_1/convolution/merged_input", "StatefulPartitionedCall/buzzguard_1/batch_normalization_6_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "leakyrelu_alpha": {"f": 0.2}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/max_pooling2d_6_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/buzzguard_1/batch_normalization_6_1/batchnorm/add_1"], "attr": {"padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/buzzguard_1/re_lu_6_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/buzzguard_1/max_pooling2d_6_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/batch_normalization_7_1/batchnorm/add_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/buzzguard_1/re_lu_6_1/Relu", "StatefulPartitionedCall/buzzguard_1/conv2d_7_1/convolution/merged_input", "StatefulPartitionedCall/buzzguard_1/batch_normalization_7_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "leakyrelu_alpha": {"f": 0.2}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/buzzguard_1/max_pooling2d_7_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/buzzguard_1/batch_normalization_7_1/batchnorm/add_1"], "attr": {"padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/buzzguard_1/re_lu_7_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/buzzguard_1/max_pooling2d_7_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/global_average_pooling2d_1_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/buzzguard_1/re_lu_7_1/Relu", "StatefulPartitionedCall/buzzguard_1/global_average_pooling2d_1_1/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/buzzguard_1/species_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/buzzguard_1/global_average_pooling2d_1_1/Mean", "StatefulPartitionedCall/buzzguard_1/species_1/Cast/ReadVariableOp", "StatefulPartitionedCall/buzzguard_1/species_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/buzzguard_1/species_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/buzzguard_1/species_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/buzzguard_1/species_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "unknown", "shape": [129, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/zeros_like", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/mul/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/ones_like", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/floordiv_3/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat_1/values_1/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/range_1/start", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/range_1/delta", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape_2/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape_3", "shape": [1, 4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Const", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/add/x", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/Reshape/shape_1", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame_step", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame_length", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/packed", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat_2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/hann_window/sub_2", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/rfft/fft_length", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/reduce_std/reduce_variance/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/reduce_std/reduce_variance/Mean_1/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/add_1/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/buzzguard_1/reshape_1_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/reshape_1_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/reshape_1_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/reshape_1_1/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/reshape_1_1/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/reshape_1_1/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/conv2d_4_1/convolution/merged_input", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/buzzguard_1/batch_normalization_4_1/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/buzzguard_1/conv2d_5_1/convolution/merged_input", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/buzzguard_1/batch_normalization_5_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/buzzguard_1/conv2d_6_1/convolution/merged_input", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/buzzguard_1/batch_normalization_6_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/buzzguard_1/conv2d_7_1/convolution/merged_input", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/buzzguard_1/batch_normalization_7_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/buzzguard_1/global_average_pooling2d_1_1/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/buzzguard_1/species_1/Cast/ReadVariableOp", "shape": [64, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/buzzguard_1/species_1/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/buzzguard_1/mel_spectrogram_1_1/stft/frame/concat/values_1_const_axis", "shape": [], "dtype": "int32"}]}]}